# Suffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..Suffix Property
Dimension Class See Also
---
The text shown after the segment's value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Suffix { get; set; }
```

Visual Basic
---
```text
Public Property Suffix As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Suffix {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
This property is for use with single-segmment dimensions only. For multi-segment dimensions use the corresponding properties of the DimensionSegment class.
# See Also
Dimension Class
Autodesk.Revit.DB Namespace